# Clase 1

# DataFrame
Un DataFrame en Python es una estructura de datos bidimensional proporcionada por la biblioteca Pandas. Se asemeja a una hoja de c치lculo de Excel o a una tabla en una base de datos, donde los datos se organizan en filas y columnas.

## Caracter칤sticas principales:
- Filas y columnas: Cada columna puede contener un tipo de dato diferente (n칰meros, cadenas, etc.), y cada fila representa una instancia de datos.
- Etiquetas: Tanto las filas como las columnas pueden tener etiquetas, lo que facilita la manipulaci칩n y el acceso a los datos.
- M칠todos y atributos: Pandas ofrece una variedad de m칠todos para importar, manipular y analizar datos, como read_csv() para importar datos desde un archivo CSV, info() para obtener informaci칩n sobre el DataFrame, y describe() para obtener estad칤sticas descriptivas.
- Para crear un dataframe en python se debe hacer uso de la libreria pandas. 

## 쯈u칠 es una librer칤a en Python?
Una librer칤a en Python es una colecci칩n de m칩dulos y paquetes que contienen funciones, clases y m칠todos predefinidos. Estas librer칤as extienden la funcionalidad b치sica del lenguaje, permitiendo a los desarrolladores reutilizar c칩digo y acceder a funcionalidades adicionales sin tener que escribir todo desde cero. Por ejemplo, hay librer칤as para manipulaci칩n de datos, visualizaci칩n, aprendizaje autom치tico, y mucho m치s.

## 쯈u칠 es Pandas?
Pandas es una de las librer칤as m치s populares en Python para la manipulaci칩n y an치lisis de datos. Fue creada por Wes McKinney en 2008 y proporciona estructuras de datos poderosas y flexibles, como Series y DataFrames, que facilitan el trabajo con datos tabulares (similares a las hojas de c치lculo de Excel).

Para usar la libreria pnadas en python debemos incluir el siguiente c칩digo
```python
import pandas as pd
```

## Ejemplo b치sico
```python
# Cargando la libreria pandas
import pandas as pd

# Crear un DataFrame a partir de un diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Mar칤a'],
    'Edad': [23, 45, 34],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia']
}

df = pd.DataFrame(data)

print(df)

```

In [711]:
# Cargando la libreria pandas
import pandas as pd

# Crear un DataFrame a partir de un diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Mar칤a'],
    'Edad': [23, 45, 34],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia']
}

df = pd.DataFrame(data)

print(df)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Luis    45  Barcelona
2  Mar칤a    34   Valencia

## Crea un dataframe con los datos de las personas del curso, las columnas son: nombre, apellido, edad, mascota. La columna mascota es booleano y depende de si la persona tiene mascota o no.

## Datraframe a partir de un diccionario
Tu diccionario debe tener el siguiente formato:

Las claves del diccionario ser치n los nombres de tus columnas.

Los valores asociados a cada clave deben ser listas (o arreglos de NumPy) que contengan los datos para esa columna espec칤fica. Es crucial que todas estas listas tengan la misma longitud, ya que cada elemento en la misma posici칩n de cada lista formar치 una fila del DataFrame.

## Ejemplo

```python
import pandas as pd
datos_alumnos = {
    'Nombre': ['Ana', 'Juan', 'Mar칤a', 'Pedro'],
    'Edad': [20, 22, 21, 23],
    'Carrera': ['Ingenier칤a', 'Derecho', 'Medicina', 'Arquitectura'],
    'Promedio': [8.5, 7.9, 9.1, 8.2]
}

```

In [712]:
import pandas as pd
datos_alumnos = {
    'Nombre': ['Ana', 'Juan', 'Mar칤a', 'Pedro'],
    'Edad': [20, 22, 21, 23],
    'Carrera': ['Ingenier칤a', 'Derecho', 'Medicina', 'Arquitectura'],
    'Promedio': [8.5, 7.9, 9.1, 8.2]
}
# Creamos el DataFrame a partir del diccionario
df_alumnos = pd.DataFrame(datos_alumnos)

# Mostramos el DataFrame para ver su contenido
print(df_alumnos)

  Nombre  Edad       Carrera  Promedio
0    Ana    20    Ingenier칤a      8.50
1   Juan    22       Derecho      7.90
2  Mar칤a    21      Medicina      9.10
3  Pedro    23  Arquitectura      8.20

Observa c칩mo pandas ha interpretado autom치ticamente:

Las claves del diccionario como los nombres de las columnas.

Las listas como los datos de cada columna.

Ha a침adido un 칤ndice num칠rico por defecto (0, 1, 2, 3) para las filas.

## Otro ejemplo

```python
import pandas as pd

# Diccionario con informaci칩n de productos
datos_productos = {
    'Producto': ['Laptop', 'Mouse', 'Teclado', 'Monitor'],
    'Precio': [1200, 25, 75, 300],
    'Stock': [50, 200, 150, 30],
    'Categoria': ['Electr칩nica', 'Accesorios', 'Accesorios', 'Electr칩nica']
}

# Crear el DataFrame
df_productos = pd.DataFrame(datos_productos)

# Imprimir el DataFrame
print(df_productos)
```

In [713]:
import pandas as pd

# Diccionario con informaci칩n de productos
datos_productos = {
    'Producto': ['Laptop', 'Mouse', 'Teclado', 'Monitor'],
    'Precio': [1200, 25, 75, 300],
    'Stock': [50, 200, 150, 30],
    'Categoria': ['Electr칩nica', 'Accesorios', 'Accesorios', 'Electr칩nica']
}

# Crear el DataFrame
df_productos = pd.DataFrame(datos_productos)

# Imprimir el DataFrame
print(df_productos)

  Producto  Precio  Stock    Categoria
0   Laptop    1200     50  Electr칩nica
1    Mouse      25    200   Accesorios
2  Teclado      75    150   Accesorios
3  Monitor     300     30  Electr칩nica

# Data frame a partir de una lista

In [714]:
import pandas as pd

datos = [
    ['Ana', 23, 'Madrid'],
    ['Luis', 34, 'Barcelona'],
    ['Carlos', 45, 'Valencia']
]

columnas = ['Nombre', 'Edad', 'Ciudad']

df = pd.DataFrame(datos, columns=columnas)
print(df)

   Nombre  Edad     Ciudad
0     Ana    23     Madrid
1    Luis    34  Barcelona
2  Carlos    45   Valencia

# Data frame a partir de una lista de diccionarios

In [715]:
datos = [
    {'Nombre': 'Ana', 'Edad': 23, 'Ciudad': 'Madrid'},
    {'Nombre': 'Luis', 'Edad': 34, 'Ciudad': 'Barcelona'},
    {'Nombre': 'Carlos', 'Edad': 45, 'Ciudad': 'Valencia'}
]

df = pd.DataFrame(datos)
print(df)

   Nombre  Edad     Ciudad
0     Ana    23     Madrid
1    Luis    34  Barcelona
2  Carlos    45   Valencia

# Dataframe a patir de una lista simple

In [716]:
datos = ['Ana', 'Luis', 'Carlos']

df = pd.DataFrame(datos, columns=['Nombre'])
print(df)

   Nombre
0     Ana
1    Luis
2  Carlos

# Crear dataframe a partir de un archivo
### DataFrame a partir de un archivo CSV

```python
import pandas as pd

# Leer un archivo CSV y crear un DataFrame
df = pd.read_csv('archivo.csv')
print(df)
```

### Ejemplo carga el archivo datos.csv

In [717]:
import pandas as pd

# Cargar el archivo CSV
df1 = pd.read_csv('datos.csv')

# Mostrar el DataFrame
print(df1)

  Nombre  Edad   Curso  Nota
0    Ana    21  F칤sica  6.50
1   Luis    22  F칤sica  5.80
2  Carla    20  F칤sica  7.20
3  Tom치s    23  F칤sica  4.90

### DataFrame a partir de un archivo Excel

```python
import pandas as pd

# Leer un archivo Excel y crear un DataFrame
df = pd.read_excel('datos.xlsx')
print(df)
```

In [718]:
import pandas as pd

# Leer un archivo Excel y crear un DataFrame
df = pd.read_excel('datos.xlsx')
print(df)

  Nombre  Edad   Curso  Nota
0    Ana    21  F칤sica  6.50
1   Luis    22  F칤sica  5.80
2  Carla    20  F칤sica  7.20
3  Tom치s    23  F칤sica  4.90

# 游늵 M칠todos comunes de DataFrames en Pandas (con ejemplos)

## 1. `.head(n)`
**Muestra las primeras `n` filas del DataFrame.**
```python
df.head(3)
```

## 2. `.tail(n)`
**Muestra las 칰ltimas `n` filas del DataFrame.**
```python
df.tail(2)
```

## 3. `.info()`
**Muestra un resumen del DataFrame: columnas, tipos de datos, valores no nulos.**
```python
df.info()
```

## 4. `.describe()`
**Estad칤sticas b치sicas (media, desviaci칩n, min, max...) de columnas num칠ricas.**
```python
df.describe()
```

## 5. `.shape`
**Devuelve una tupla con el n칰mero de filas y columnas.**
```python
df.shape  # (filas, columnas)
```

## 6. `.columns`
**Devuelve el listado de nombres de columnas.**
```python
df.columns
```

## 7. `.dtypes`
**Devuelve el tipo de datos de cada columna.**
```python
df.dtypes
```

## 8. `.isnull()`
**Indica con True/False si un valor es nulo.**
```python
df.isnull()
```

## 9. `.dropna()`
**Elimina filas con valores nulos.**
```python
df.dropna()
```

## 10. `.fillna(valor)`
**Rellena los valores nulos con `valor`.**
```python
df.fillna(0)
```

## 11. `.sort_values(by='col')`
**Ordena el DataFrame seg칰n una columna.**
```python
df.sort_values(by='Edad')
```

## 12. `.groupby('col')`
**Agrupa datos por una columna (칰til para operaciones estad칤sticas).**
```python
df.groupby('Ciudad').mean()
```

## 13. `.value_counts()`
**Cuenta la frecuencia de cada valor en una columna.**
```python
df['Ciudad'].value_counts()
```

## 14. `.loc[filas, columnas]`
**Accede a filas/columnas por etiqueta.**
```python
df.loc[0, 'Nombre']  # primer nombre
```

## 15. `.iloc[fila, columna]`
**Accede por posici칩n (칤ndice entero).**
```python
df.iloc[0, 1]  # valor en fila 0, columna 1
```

## 16. `.rename(columns={'ViejoNombre': 'NuevoNombre'})`
**Renombra columnas.**
```python
df.rename(columns={'Edad': 'A침os'})
```

## 17. `.drop('col', axis=1)`
**Elimina una columna.**
```python
df.drop('Ciudad', axis=1)
```

## 18. `.apply(func)`
**Aplica una funci칩n a cada valor de una columna.**
```python
df['Edad'].apply(lambda x: x + 1)
```

## 19. `.astype(tipo)`
**Cambia el tipo de datos de una columna.**
```python
df['Edad'] = df['Edad'].astype(float)
```

## 20. `.duplicated()`
**Detecta filas duplicadas.**
```python
df.duplicated()
```

In [719]:
import pandas as pd
df = pd.read_csv('articulos.csv')
df

,ID_Articulo,Nombre_Articulo,Categoria,Precio_Unitario,Stock,Disponibilidad,Fecha_Ultima_Venta,Unidades_Vendidas_Ultimo_Mes,Valor_Total_Ventas_Ultimo_Mes
0,1,Altavoz Inteligente Amazon Echo Dot,Electr칩nica,552.12,391,En Stock,2025-01-28,114,14275.98
1,2,Anillo de Compromiso Blue Nile,Moda,440.09,242,En Stock,2024-08-01,92,4427.35
2,3,Tostadora Smeg,Hogar y Cocina,224.23,261,En Stock,2024-11-20,131,10012.87
3,4,Termostato Inteligente Ecobee,Electr칩nica,1359.81,215,En Stock,2025-05-19,178,14169.57
4,5,Microscopio AmScope,Juguetes,114.73,472,En Stock,2024-12-07,175,18854.76
...,...,...,...,...,...,...,...,...,...
195,196,Auriculares Sony WH-1000XM5,Electr칩nica,1346.06,478,En Stock,2024-11-06,177,10996.65
196,197,Tablet Apple iPad Air,Electr칩nica,1479.92,109,En Stock,2024-11-06,177,10996.65
197,198,Reloj Inteligente Apple Watch Series 9,Electr칩nica,1359.81,215,En Stock,2025-05-19,178,14169.57
198,199,Smartphone Samsung Galaxy S24,Electr칩nica,1404.99,149,En Stock,2025-04-20,131,2343.68
199,200,Laptop HP Spectre x360,Electr칩nica,128.53,197,En Stock,2024-11-23,170,16632.18

# Clase 2: Series de Panda (pandas Series)
Una serie en Pandas es una estructura unidimensional que puede contener cualquier tipo de dato (enteros, cadenas, flotantes, etc.). Es similar a una lista o un arreglo de  pero con etiquetas (칤ndices) para cada elemento. Podemos pensar en una serie como una columna de un DataFrame, pero con la ventaja de que puede ser manipulada de forma independiente.

## Ejemplo b치sico de una serie pandas a partir de una lista
```python
import pandas as pd

# Crear una serie a partir de una lista
datos = [10, 20, 30, 40, 50]
serie = pd.Series(datos)

print(serie)
```

In [720]:
import pandas as pd

# Crear una serie a partir de una lista
datos = [10, 20, 30, 40, 50]
serie = pd.Series(datos)

print(serie)

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Accediendo a los elementos de una serie usando el 칤ndice
```python
import pandas as pd
# Crear una serie con 칤ndices personalizados
datos = [10, 20, 30, 40, 50]
serie = pd.Series(datos)
print(serie[0])  # Accede al elemento con 칤ndice 0
print(serie[1])  # Accede al elemento con 칤ndice 1
print(serie[2])  # Accede al elemento con 칤ndice 2
print(serie[3])  # Accede al elemento con 칤ndice 3
print(serie[4])  # Accede al elemento con 칤ndice 4
```

In [721]:
import pandas as pd
# Crear una serie con 칤ndices personalizados
datos = [10, 20, 30, 40, 50]
serie = pd.Series(datos)
print(serie[0])  # Accede al elemento con 칤ndice 0
print(serie[1])  # Accede al elemento con 칤ndice 1
print(serie[2])  # Accede al elemento con 칤ndice 2
print(serie[3])  # Accede al elemento con 칤ndice 3
print(serie[4])  # Accede al elemento con 칤ndice 4

10
20
30
40
50

## Podemos cambiar los 칤ndices de una serie pandas agregando el par치metro `index` al momento de crear la serie

```python
import pandas as pd   
# Crear una serie con 칤ndices personalizados
datos = ["Pera", "Manzana", "Naranja", "Pl치tano", "Uva"]
serie1 = pd.Series(datos, index=['a', 'b', 'c', 'd', 'e']) 
print(serie)
```

In [722]:
import pandas as pd   
# Crear una serie con 칤ndices personalizados
datos = ["Pera", "Manzana", "Naranja", "Pl치tano", "Uva"]
serie1 = pd.Series(datos, index=['a', 'b', 'c', 'd', 'e']) 
print(serie)

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Acceder a los elementos de una serie usando sus 칤nidces personalizados
```python
print(serie1['a'])  # Accede al elemento con 칤ndice 'a'
print(serie1['b'])  # Accede al elemento con 칤ndice 'b'
print(serie1['c'])  # Accede al elemento con 칤ndice 'c'
print(serie1['d'])  # Accede al elemento con 칤ndice 'd'
print(serie1['e'])  # Accede al elemento con 칤ndice 'e'
```

In [723]:
print(serie1['a'])  # Accede al elemento con 칤ndice 'a'
print(serie1['b'])  # Accede al elemento con 칤ndice 'b'
print(serie1['c'])  # Accede al elemento con 칤ndice 'c'
print(serie1['d'])  # Accede al elemento con 칤ndice 'd'
print(serie1['e'])  # Accede al elemento con 칤ndice 'e'

Pera
Manzana
Naranja
Pl치tano
Uva

## Ordenando una serie pandas
```python
import pandas as pd
# Crear una serie con datos desordenados          
datos = [50, 20, 10, 40, 30]
serie = pd.Series(datos)
# Ordenar la serie
serie_ordenada = serie.sort_values()
print(serie_ordenada)
```

In [724]:
import pandas as pd
# Crear una serie con datos desordenados          
datos = [50, 20, 10, 40, 30]
serie = pd.Series(datos)
# Ordenar la serie
serie_ordenada = serie.sort_values()
print(serie_ordenada)

2    10
1    20
4    30
3    40
0    50
dtype: int64

## Ordenando de manera descendente
```   python
serie_ordenada_desc = serie.sort_values(ascending=False)
print(serie_ordenada_desc)
```

In [725]:
serie_ordenada_desc = serie.sort_values(ascending=False)
print(serie_ordenada_desc)

0    50
3    40
4    30
1    20
2    10
dtype: int64

## C치lculo de m치ximos, m칤nimos, suma, desviaci칩n estandard.        

```python
print(serie.max())  # M치ximo valor de la serie
print(serie.min())  # M칤nimo valor de la serie
print(serie.sum())  # Suma de la serie
print(serie.max())  # M치ximo de la serie
print(serie.std())  # desviaci칩n est치ndar     
```

In [726]:
print(serie.max())  # M치ximo valor de la serie
print(serie.min())  # M칤nimo valor de la serie
print(serie.sum())  # Suma de la serie
print(serie.max())  # M치ximo de la serie
print(serie.std())  # desviaci칩n est치ndar

50
10
150
50
15.811388300841896

## Selecci칩n de elementos en un dataframe

## Selecci칩n de filas con el m칠todo `.loc`

In [727]:
import pandas as pd

data = {
  "time":[120, 60, 45],
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data)

print(df)

   time  calories  duration
0   120       420        50
1    60       380        40
2    45       390        45

In [728]:
# seleccionando la primera fila 
# Si se usa un solo corchete retorna una serie 
print(df.iloc[0]) 
print(type(df.iloc[0]))

time        120
calories    420
duration     50
Name: 0, dtype: int64
<class 'pandas.core.series.Series'>

In [729]:
# Seleccionando la primera fila (otra forma)
# si se usan dos corchetes retorna un dataframe
print(df.iloc[[0]])
print(type(df.iloc[[0]]))

   time  calories  duration
0   120       420        50
<class 'pandas.core.frame.DataFrame'>

In [730]:
# Seleccionando varias filas
print(df.iloc[[1, 2]])

   time  calories  duration
1    60       380        40
2    45       390        45

## Nombrando los 칤ndices de un dataframe

In [731]:
data = {
  "time":[120, 60, 45, 60],
  "calories": [420, 380, 390, 400],
  "duration": [50, 40, 45, 39]
}
df = pd.DataFrame(data, index=["day1", "day2", "day3", "day4"])

print(df)

      time  calories  duration
day1   120       420        50
day2    60       380        40
day3    45       390        45
day4    60       400        39

## Seleccionando filas con nombres con .loc

In [732]:
df.loc["day1"] # Esto es una serie

time        120
calories    420
duration     50
Name: day1, dtype: int64

In [733]:
df.loc[["day1"]] # Esto es un dataframe

      time  calories  duration
day1   120       420        50

In [734]:
df.loc[["day2", "day4", "day3"]]

      time  calories  duration
day2    60       380        40
day4    60       400        39
day3    45       390        45

## Recuerda usa `.iloc` para 칤ndices num칠ricos y `.loc` con 칤ndices con nombres.

## Se pueden usar rangos para seleccionar filas

In [735]:
df.loc["day1":"day3"] # selecciona desde el primer 칤ndice hasta el 칰ltimo, ambos extremos incluidos.

      time  calories  duration
day1   120       420        50
day2    60       380        40
day3    45       390        45

## Clase 3

## Selecci칩n de columnas en un dataframe

In [736]:
import pandas as pd


df = pd.DataFrame({
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Marta', 'Josefa', 'Mat칤as', 'Jos칠', 'Felipe', 'Ra칰l', 'Claudia'],
    'Apellido': ['Cid', 'Rodriguez', 'Poblete', 'Valenzuela', 'Rodriguez', 'Valencia', 'G칩mez', 'Soto', 'Mu침oz', 'Herrera'],
    'Edad': [20, 25, 30, 23, 16, 28, 35, 22, 27, 31], 
    'Ciudad': ['Santiago', 'Valpara칤so', 'Concepci칩n', 'Rancagua', 'Rancagua', 'Temuco', 'Antofagasta', 'La Serena', 'Iquique', 'Puerto Montt'],
    'Soltero': [True, False, True, True, False, True, False, True, False, True],
    'Carrera': ['Medicina','Ingenier칤a','Arquitectura','Pedagog칤a',
    'Ingenier칤a','Medicina','Pedagog칤a','Arquitectura','Ingenier칤a','Medicina']

})


df

    Nombre    Apellido  Edad        Ciudad  Soltero       Carrera
0      Ana         Cid    20      Santiago     True      Medicina
1     Luis   Rodriguez    25    Valpara칤so    False    Ingenier칤a
2    Pedro     Poblete    30    Concepci칩n     True  Arquitectura
3    Marta  Valenzuela    23      Rancagua     True     Pedagog칤a
4   Josefa   Rodriguez    16      Rancagua    False    Ingenier칤a
5   Mat칤as    Valencia    28        Temuco     True      Medicina
6     Jos칠       G칩mez    35   Antofagasta    False     Pedagog칤a
7   Felipe        Soto    22     La Serena     True  Arquitectura
8     Ra칰l       Mu침oz    27       Iquique    False    Ingenier칤a
9  Claudia     Herrera    31  Puerto Montt     True      Medicina

In [737]:
print(df['Nombre'])  # Devuelve una Serie con los nombres

0        Ana
1       Luis
2      Pedro
3      Marta
4     Josefa
5     Mat칤as
6       Jos칠
7     Felipe
8       Ra칰l
9    Claudia
Name: Nombre, dtype: object

In [738]:
print(df[['Nombre']])  # Devuelve un dataframe con los nombres

    Nombre
0      Ana
1     Luis
2    Pedro
3    Marta
4   Josefa
5   Mat칤as
6     Jos칠
7   Felipe
8     Ra칰l
9  Claudia

In [739]:
print(df[["Nombre", "Soltero"]]) # Seleccionando varias columnas

    Nombre  Soltero
0      Ana     True
1     Luis    False
2    Pedro     True
3    Marta     True
4   Josefa    False
5   Mat칤as     True
6     Jos칠    False
7   Felipe     True
8     Ra칰l    False
9  Claudia     True

## Seleccionado con condiciones

In [740]:
# Personas mayortes de 25 a침os
print(df[df["Edad"]>25])

    Nombre  Apellido  Edad        Ciudad  Soltero       Carrera
2    Pedro   Poblete    30    Concepci칩n     True  Arquitectura
5   Mat칤as  Valencia    28        Temuco     True      Medicina
6     Jos칠     G칩mez    35   Antofagasta    False     Pedagog칤a
8     Ra칰l     Mu침oz    27       Iquique    False    Ingenier칤a
9  Claudia   Herrera    31  Puerto Montt     True      Medicina

In [741]:
# Seleccionando a la persona de nombre "Ana"
print(df[df["Nombre"]=="Ana"])

  Nombre Apellido  Edad    Ciudad  Soltero   Carrera
0    Ana      Cid    20  Santiago     True  Medicina

In [742]:
# Seleccionado a las personas de apellido 'Rodriguez'ArithmeticError
df[df['Apellido'] == 'Rodriguez']

   Nombre   Apellido  Edad      Ciudad  Soltero     Carrera
1    Luis  Rodriguez    25  Valpara칤so    False  Ingenier칤a
4  Josefa  Rodriguez    16    Rancagua    False  Ingenier칤a

In [743]:
# Seleccionando personas de apellido 'Rodriguez' que viven en 'Valparaiso'
df[(df['Apellido'] =='Rodriguez') & (df['Ciudad'] =='Valpara칤so')]

  Nombre   Apellido  Edad      Ciudad  Soltero     Carrera
1   Luis  Rodriguez    25  Valpara칤so    False  Ingenier칤a

In [744]:
# Calculando el promedio de las edades

df['Edad'].mean()

25.7

In [745]:
# 쮺u치ntas personas est치n solteras?
df["Soltero"].sum()

6

## Agregando columnas a un dataframe

In [746]:
# Agregar la columna 'Estatus' seg칰n la la lista ['A', 'S', 'S', 'A','A', 'A', 'S', 'S', 'A','A']
# A= Activo, S = Suspendido
df['Estatus'] = ['A', 'S', 'S', 'A','A', 'A', 'S', 'S', 'A','A']
df

    Nombre    Apellido  Edad        Ciudad  Soltero       Carrera Estatus
0      Ana         Cid    20      Santiago     True      Medicina       A
1     Luis   Rodriguez    25    Valpara칤so    False    Ingenier칤a       S
2    Pedro     Poblete    30    Concepci칩n     True  Arquitectura       S
3    Marta  Valenzuela    23      Rancagua     True     Pedagog칤a       A
4   Josefa   Rodriguez    16      Rancagua    False    Ingenier칤a       A
5   Mat칤as    Valencia    28        Temuco     True      Medicina       A
6     Jos칠       G칩mez    35   Antofagasta    False     Pedagog칤a       S
7   Felipe        Soto    22     La Serena     True  Arquitectura       S
8     Ra칰l       Mu침oz    27       Iquique    False    Ingenier칤a       A
9  Claudia     Herrera    31  Puerto Montt     True      Medicina       A

In [747]:
## Agregando Notas "P1", "P2", "P3"
df["P1"]=[4, 5, 6, 5, 4, 3, 2, 3, 2, 4]
df["P2"]=[3, 4, 5, 4, 6, 7, 3, 3, 5, 4]
df["P3"]=[2, 4, 6, 3, 4, 3, 2, 3, 2, 4]
df

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,Estatus,P1,P2,P3
0,Ana,Cid,20,Santiago,True,Medicina,A,4,3,2
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,S,5,4,4
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,S,6,5,6
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,A,5,4,3
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,A,4,6,4
5,Mat칤as,Valencia,28,Temuco,True,Medicina,A,3,7,3
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,S,2,3,2
7,Felipe,Soto,22,La Serena,True,Arquitectura,S,3,3,3
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,A,2,5,2
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,A,4,4,4

In [748]:
## Agregando promedio de los estudiantes
#df["Promedio"] = (df["P1"]+df["P2"]+df["P3"])/3
# Otra forma m치s autom치tica es 
df["Promedio"] = df[['P1', 'P2', 'P3']].mean(axis=1)

df

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,Estatus,P1,P2,P3,Promedio
0,Ana,Cid,20,Santiago,True,Medicina,A,4,3,2,3.00
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,S,5,4,4,4.33
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,S,6,5,6,5.67
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,A,5,4,3,4.00
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,A,4,6,4,4.67
5,Mat칤as,Valencia,28,Temuco,True,Medicina,A,3,7,3,4.33
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,S,2,3,2,2.33
7,Felipe,Soto,22,La Serena,True,Arquitectura,S,3,3,3,3.00
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,A,2,5,2,3.00
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,A,4,4,4,4.00

In [749]:
# Mostrando solo 2 decimales en promedio
pd.options.display.float_format = '{:.2f}'.format  # Muestra con 2 decimales
df

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,Estatus,P1,P2,P3,Promedio
0,Ana,Cid,20,Santiago,True,Medicina,A,4,3,2,3.00
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,S,5,4,4,4.33
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,S,6,5,6,5.67
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,A,5,4,3,4.00
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,A,4,6,4,4.67
5,Mat칤as,Valencia,28,Temuco,True,Medicina,A,3,7,3,4.33
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,S,2,3,2,2.33
7,Felipe,Soto,22,La Serena,True,Arquitectura,S,3,3,3,3.00
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,A,2,5,2,3.00
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,A,4,4,4,4.00

##

In [ ]:
#  Clasificar estudiantes, agregando la columnna clasificaci칩n mostrando "A" si el estudiante aprob칩 y "R" si el estudiante no aprob칩

def clasificacion(nota):
    if nota >= 4:
        return "A"
    else:
        return "B"
df["Clasificacion"]= df["Promedio"].apply(clasificacion)
df

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,Estatus,P1,P2,P3,Promedio,Clasificacion
0,Ana,Cid,20,Santiago,True,Medicina,A,4,3,2,3.00,B
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,S,5,4,4,4.33,A
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,S,6,5,6,5.67,A
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,A,5,4,3,4.00,A
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,A,4,6,4,4.67,A
5,Mat칤as,Valencia,28,Temuco,True,Medicina,A,3,7,3,4.33,A
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,S,2,3,2,2.33,B
7,Felipe,Soto,22,La Serena,True,Arquitectura,S,3,3,3,3.00,B
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,A,2,5,2,3.00,B
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,A,4,4,4,4.00,A

## Ejercicios
- Muestra s칩lo los aprobados en pantalla
- Muestra s칩lo los reprobados
- Elimina las columnas Ciudad, Estatus, Soltero del dataframe original
- Muestra en pantalla los estudiantes aprobados mayores de 30 a침os
- Muestra en pantalla los estudiantes menore de 30 reprobados y calcula su promedio
- Calcula el promedio de los estudiantes de medicina
- Calcula cu치ntos estudiantes aprobaron
- 쯈u칠 podemos decir de los estudiantes de ingenier칤a?

## Eliminar columnas de un dataframe
Para eliminar columnnas se usa el m칠todo `.drop()` con la siguiente sintaxis

1. ```df.drop(columns=['column_name1', 'column_name2', ....])```: Este m칠todo retorna un dataframe, pero no elimina las columnas del dataframe original.
2. Para eliminar efectivamente las columnnas del dataframe original se debe agregar el argumento ```inplace=True```.

In [751]:
# Mostremos las columnas del dataframe
print(df.columns)

Index(['Nombre', 'Apellido', 'Edad', 'Ciudad', 'Soltero', 'Carrera', 'Estatus',
       'P1', 'P2', 'P3', 'Promedio', 'Clasificacion'],
      dtype='object')

In [752]:
df.drop(columns=["Estatus"])

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,P1,P2,P3,Promedio,Clasificacion
0,Ana,Cid,20,Santiago,True,Medicina,4,3,2,3.00,B
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,5,4,4,4.33,A
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,6,5,6,5.67,A
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,5,4,3,4.00,A
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,4,6,4,4.67,A
5,Mat칤as,Valencia,28,Temuco,True,Medicina,3,7,3,4.33,A
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,2,3,2,2.33,B
7,Felipe,Soto,22,La Serena,True,Arquitectura,3,3,3,3.00,B
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,2,5,2,3.00,B
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,4,4,4,4.00,A

In [753]:
# Dataframe original (no alterado)
df

,Nombre,Apellido,Edad,Ciudad,Soltero,Carrera,Estatus,P1,P2,P3,Promedio,Clasificacion
0,Ana,Cid,20,Santiago,True,Medicina,A,4,3,2,3.00,B
1,Luis,Rodriguez,25,Valpara칤so,False,Ingenier칤a,S,5,4,4,4.33,A
2,Pedro,Poblete,30,Concepci칩n,True,Arquitectura,S,6,5,6,5.67,A
3,Marta,Valenzuela,23,Rancagua,True,Pedagog칤a,A,5,4,3,4.00,A
4,Josefa,Rodriguez,16,Rancagua,False,Ingenier칤a,A,4,6,4,4.67,A
5,Mat칤as,Valencia,28,Temuco,True,Medicina,A,3,7,3,4.33,A
6,Jos칠,G칩mez,35,Antofagasta,False,Pedagog칤a,S,2,3,2,2.33,B
7,Felipe,Soto,22,La Serena,True,Arquitectura,S,3,3,3,3.00,B
8,Ra칰l,Mu침oz,27,Iquique,False,Ingenier칤a,A,2,5,2,3.00,B
9,Claudia,Herrera,31,Puerto Montt,True,Medicina,A,4,4,4,4.00,A

In [754]:
 # Usando el argumento inplace
df.drop(columns=["Estatus", "Soltero"], inplace=True)

In [755]:
# Dataframe original (alterado)
df

,Nombre,Apellido,Edad,Ciudad,Carrera,P1,P2,P3,Promedio,Clasificacion
0,Ana,Cid,20,Santiago,Medicina,4,3,2,3.00,B
1,Luis,Rodriguez,25,Valpara칤so,Ingenier칤a,5,4,4,4.33,A
2,Pedro,Poblete,30,Concepci칩n,Arquitectura,6,5,6,5.67,A
3,Marta,Valenzuela,23,Rancagua,Pedagog칤a,5,4,3,4.00,A
4,Josefa,Rodriguez,16,Rancagua,Ingenier칤a,4,6,4,4.67,A
5,Mat칤as,Valencia,28,Temuco,Medicina,3,7,3,4.33,A
6,Jos칠,G칩mez,35,Antofagasta,Pedagog칤a,2,3,2,2.33,B
7,Felipe,Soto,22,La Serena,Arquitectura,3,3,3,3.00,B
8,Ra칰l,Mu침oz,27,Iquique,Ingenier칤a,2,5,2,3.00,B
9,Claudia,Herrera,31,Puerto Montt,Medicina,4,4,4,4.00,A

## Eliminando filas de dataframe
1. Eliminado por 칤ndice

In [756]:
import pandas as pd

# Crear un DataFrame de ejemplo
df = pd.DataFrame({
    "Nombre": ["Ana", "Luis", "Pedro"],
    "Edad": [23, 35, 40]
}, index=["a", "b", "c"])

# Mostrar df

print(df)

  Nombre  Edad
a    Ana    23
b   Luis    35
c  Pedro    40

In [757]:
# Eliminar la fila con 칤ndice "b"
df_sin_b = df.drop("b")
print(df_sin_b)

  Nombre  Edad
a    Ana    23
c  Pedro    40

2. Eliminado de varias filas por 칤ndice

In [758]:

df_sin_varias = df.drop(["a", "c"])

3. Eliminar filas de dataframe original

In [759]:
df_sin_varias = df.drop(["a", "c"], inplace=True)
print(df)

  Nombre  Edad
b   Luis    35

4. Eliminado de filas con 칤ndices num칠ricos por default

In [760]:

import pandas as pd

# Crear un DataFrame de ejemplo
df = pd.DataFrame({
    "Nombre": ["Ana", "Luis", "Pedro", "marcos", "carlos"],
    "Edad": [23, 35, 40, 30, 20]
})

# Mostrar df

print(df)
df.drop([1,2,3]) # Elimina filas 1, 2, 3

   Nombre  Edad
0     Ana    23
1    Luis    35
2   Pedro    40
3  marcos    30
4  carlos    20

   Nombre  Edad
0     Ana    23
4  carlos    20

5. Eliminado por condici칩n (filtrado)
```python
# Eliminar filas donde Edad es mayor de 30
df_filtrado = df[df["Edad"] <= 30]

```

## Leer archivo con formato JSON en Pandas

In [761]:
# Leyendo con pd.read_json()
import pandas as pd

df = pd.read_json('data.json')

print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130    409.10
1          60    117       145    479.00
2          60    103       135    340.00
3          45    109       175    282.40
4          45    117       148    406.00
5          60    102       127    300.50
6          60    110       136    374.00
7          45    104       134    253.30
8          30    109       133    195.10
9          60     98       124    269.00
10         60    103       147    329.30
11         60    100       120    250.70
12         60    106       128    345.30
13         60    104       132    379.30
14         60     98       123    275.00
15         60     98       120    215.20
16         60    100       120    300.00
17         45     90       112       NaN
18         60    103       123    323.00
19         45     97       125    243.00
20         60    108       131    364.20
21         45    100       119    282.00
22         60    130       101    300.00
23         45    105       132    246.00
24         60    102       126    334.50
25         60    100       120    250.00
26         60     92       118    241.00
27         60    103       132       NaN
28         60    100       132    280.00
29         60    102       129    380.30
30         60     92       115    243.00
31         45     90       112    180.10
32         60    101       124    299.00
33         60     93       113    223.00
34         60    107       136    361.00
35         60    114       140    415.00
36         60    102       127    300.50
37         60    100       120    300.10
38         60    100       120    300.00
39         45    104       129    266.00
40         45     90       112    180.10
41         60     98       126    286.00
42         60    100       122    329.40
43         60    111       138    400.00
44         60    111       131    397.00
45         60     99       119    273.00
46         60    109       153    387.60
47         45    111       136    300.00
48         45    108       129    298.00
49         60    111       139    397.60
50         60    107       136    380.20
51         80    123       146    643.10
52         60    106       130    263.00
53         60    118       151    486.00
54         30    136       175    238.00
55         60    121       146    450.70
56         60    118       121    413.00
57         45    115       144    305.00
58         20    153       172    226.40
59         45    123       152    321.00
60        210    108       160   1376.00
61        160    110       137   1034.40
62        160    109       135    853.00
63         45    118       141    341.00
64         20    110       130    131.40
65        180     90       130    800.40
66        150    105       135    873.40
67        150    107       130    816.00
68         20    106       136    110.40
69        300    108       143   1500.20
70        150     97       129   1115.00
71         60    109       153    387.60
72         90    100       127    700.00
73        150     97       127    953.20
74         45    114       146    304.00
75         90     98       125    563.20
76         45    105       134    251.00
77         45    110       141    300.00
78        120    100       130    500.40
79        270    100       131   1729.00
80         30    159       182    319.20
81         45    149       169    344.00
82         30    103       139    151.10
83        120    100       130    500.00
84         45    100       120    225.30
85         30    151       170    300.10
86         45    102       136    234.00
87        120    100       157   1000.10
88         45    129       103    242.00
89         20     83       107     50.30
90        180    101       127    600.10
91         45    107       137       NaN
92         30     90       107    105.30
93         15     80       100     50.50
94         20    150       171    127.40
95         20    151       168    229.40
96         30     95       128    128.20
97         25    152       168    244.20
98         30    109       131    188.20
99         90     93       124    604.10
100        20     95       112     77.70
101        90     90       110    500.00
102        90     90       100    500.00
103        90     90       100    500.40
104        30     92       108     92.70
105        30     93       128    124.00
106       180     90       120    800.30
107        30     90       120     86.20
108        90     90       120    500.30
109       210    137       184   1860.40
110        60    102       124    325.20
111        45    107       124    275.00
112        15    124       139    124.20
113        45    100       120    225.30
114        60    108       131    367.60
115        60    108       151    351.70
116        60    116       141    443.00
117        60     97       122    277.40
118        60    105       125       NaN
119        60    103       124    332.70
120        30    112       137    193.90
121        45    100       120    100.70
122        60    119       169    336.70
123        60    107       127    344.90
124        60    111       151    368.50
125        60     98       122    271.00
126        60     97       124    275.30
127        60    109       127    382.00
128        90     99       125    466.40
129        60    114       151    384.00
130        60    104       134    342.50
131        60    107       138    357.50
132        60    103       133    335.00
133        60    106       132    327.50
134        60    103       136    339.00
135        20    136       156    189.00
136        45    117       143    317.70
137        45    115       137    318.00
138        45    113       138    308.00
139        20    141       162    222.40
140        60    108       135    390.00
141        60     97       127       NaN
142        45    100       120    250.40
143        45    122       149    335.40
144        60    136       170    470.20
145        45    106       126    270.80
146        60    107       136    400.00
147        60    112       146    361.90
148        30    103       127    185.00
149        60    110       150    409.40
150        60    106       134    343.00
151        60    109       129    353.20
152        60    109       138    374.00
153        30    150       167    275.80
154        60    105       128    328.00
155        60    111       151    368.50
156        60     97       131    270.40
157        60    100       120    270.40
158        60    114       150    382.80
159        30     80       120    240.90
160        30     85       120    250.40
161        45     90       130    260.40
162        45     95       130    270.00
163        45    100       140    280.90
164        60    105       140    290.80
165        60    110       145    300.40
166        60    115       145    310.20
167        75    120       150    320.40
168        75    125       150    330.40

## Creando archivo json en python 
JSON = Dicionario en python

In [762]:
# Creando archivo json en python 
import pandas as pd

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409.1,
    "1":479.0,
    "2":340.0,
    "3":282.4,
    "4":406.0,
    "5":300.5
  }
}

df = pd.DataFrame(data)

print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130    409.10
1        60    117       145    479.00
2        60    103       135    340.00
3        45    109       175    282.40
4        45    117       148    406.00
5        60    102       127    300.50